Data basics
============

**Table of contents**<a id='toc0_'></a>    
- 1. [Working with structured data in Python](#toc1_)    
- 2. [Pandas dataframes](#toc2_)    
  - 2.1. [Indexing ("subsetting")](#toc2_1_)    
  - 2.2. [Adding a variable](#toc2_2_)    
  - 2.3. [Assignments to a subset of rows](#toc2_3_)    
  - 2.4. [Copies vs. views](#toc2_4_)    
  - 2.5. [The index](#toc2_5_)    
  - 2.6. [Series and numpy arrays](#toc2_6_)    
  - 2.7. [Calling functions on a DataFrame](#toc2_7_)    

<!-- vscode-jupyter-toc-config
	numbering=true
	anchor=true
	flat=false
	minLevel=1
	maxLevel=6
	/vscode-jupyter-toc-config -->
<!-- THIS CELL WILL BE REPLACED ON TOC UPDATE. DO NOT WRITE YOUR TEXT IN THIS CELL -->

# 1. <a id='toc1_'></a>[Working with structured data in Python](#toc0_)

By and large, handling data sets in Python means working with **Pandas**.  

Pandas is a standard element in the Anaconda package, so you'll have it automatically.  

The fact that Python is a general purpose language *and* has a good way of handling data sets through pandas, which has helped it become such a popular language for scientific and general purposes.  

Today, you will learn about the pandas **data frame** object and the **pandas series**.

**Links:**

1. Official [tutorials](https://pandas.pydata.org/pandas-docs/stable/getting_started/tutorials.html)
2. DataCamp's [pandas' cheat sheet](https://www.datacamp.com/community/blog/python-pandas-cheat-sheet)
3. DataCamp has additional courses on pandas like [Writing efficient code with pandas](https://app.datacamp.com/learn/courses/writing-efficient-code-with-pandas).
4. About the [pandas project](https://pandas.pydata.org/about/)

In [25]:
import pandas as pd
from IPython.display import display

# 2. <a id='toc2_'></a>[Pandas dataframes](#toc0_)

In Pandas, the fundamental object of interest is a **pandas dataframe**. 

A pandas data frame is superficially like the data frames you know from stata and sas: it is in 2-d, each column has a name. 

The *data type* of a column in a pandas data frame is a **pandas series**.

A pandas series is **a lot like a numpy array** and they can be used in much the same way.  

A pandas data frame can be thought of as a **dictionary of pandas series**. (Keys are column names) 

To create a DataFrame:

In [26]:
ids = pd.Series([1, 2, 3])
incs = pd.Series([11.7, 13.9, 14.6])
names = pd.Series(['Vitus', 'Maximilian', 'Bo-bob'])

# Use data frame definition
X = pd.DataFrame({'id': ids, 'inc':incs, 'name': names})
display(X)

   id   inc        name
0   1  11.7       Vitus
1   2  13.9  Maximilian
2   3  14.6      Bo-bob

When creating a DataFrame, you can also rely on python to recast the variables into pandas series at creation.

In [27]:
# Variables are cast into pandas series as the DataFrame is created
X = pd.DataFrame({'id': [1, 2, 3], 
                  'inc': [11.7, 13.9, 14.6], 
                  'name': ['Vitus', 'Maximilian', 'Bo-bob']}) 
type(X['id'])

pandas.core.series.Series

You can also pass in data as a list of lists and provide column names as argument

In [28]:
X = pd.DataFrame(data = [[1,11.7,'Vitus'],
                         [2,13.9,'Maximilian'],
                         [3,14.6,'Bo-Bob']], 
                 columns=['id','inc','name'])
display(X)

   id   inc        name
0   1  11.7       Vitus
1   2  13.9  Maximilian
2   3  14.6      Bo-Bob

**A dataframe is essentially a matrix.**

* rows = observations 
* columns = variables 
* the index = keeps track of the rows' locations

**General information:**

In [29]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      3 non-null      int64
 1   inc     3 non-null      float64
 2   name    3 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

**What does `object` mean?** In practice it is a `str` (and should generally only be used when you are dealing with strings), in reality it can contain multiple types (strings, floats, NaNs, etc.) and this can create difficulties, if you're not carefull.

**Note:** You can also show a dataframe in the  middle of some code.

In [30]:
print('before')
display(X)
print('after')

before

   id   inc        name
0   1  11.7       Vitus
1   2  13.9  Maximilian
2   3  14.6      Bo-Bob

after

## 2.1. <a id='toc2_1_'></a>[Indexing ("subsetting")](#toc0_)

**Choosing a subset of the rows and/or columns of a dataframe is known as "indexing"**. 

Recall the stuff about ***slicing*** and ***logical indices*** from previous lectures. Since Pandas is build in Numpy, we can do the same here.  

All pandas dataframes are born with the method `.loc[]` and `.iloc[]`:
1. `.iloc[]` is for **numeric indexing** 
2. `.loc[]` for **logical** and **name-based** indexing. 

Examples
* `df.iloc[0:3,1]` selects rows 0,1,2 and column 2.
* `df.loc[:, ['year']]` selects all rows (indicated by `:`) but only the column (variable) `year`. 
* `df.loc[df['year'] == 2002, :]` selects the rows where the variable `year` is equal to 2002 and all columns (indicated by `:`)
* `df.loc[df['year'] == 2002, ['name']]` selects the variable `name` and shows the rows where `year` is equal to 2002. 

*You cannot write*:  
`df.iloc[0:2, ['year']]`  

*You should not write*  
`df.loc[0:2, ['year']]`  
*It will only work with a numerical index and now the slice intervals are **closed instead of half open***

In general, the **syntax** is `df.loc[CONDITION, [VARLIST]]`, where `CONDITION` is a vector of logical statements with the same length as the number of rows in the dataframe, and `VARLIST` is a list over variables.

There are other ways of indexing in pandas with shorter syntax. I would focus on `.loc[]` in the begining as it very general.

In [31]:
# Use logical indexing to subset from variable name based on id
X.loc[X['id'] > 1, ['name']]

         name
1  Maximilian
2      Bo-Bob

Subset all variables:

In [32]:
X.loc[X['id'] > 1]

   id   inc        name
1   2  13.9  Maximilian
2   3  14.6      Bo-Bob

**Alternatives:**

Create a boolean series

In [33]:
I = X['id'] > 1
print(I)
X.loc[I, ['name']]

0    False
1     True
2     True
Name: id, dtype: bool

         name
1  Maximilian
2      Bo-Bob

Use `.VARIABLE` notation

In [34]:
X.loc[(X.id > 1) & (X.inc > 14), ['id','name']]

   id    name
2   3  Bo-Bob

Why do you think the `.VARIABLE` notation works at all? What does it make you suspect a variable is to the DataFrame?

Subsetting with numerical indexing works the same way as lists and arrays.  
**Syntax:** `df.iloc[ROW INDICES, [COLUMN INDICES]]`

In [35]:
display(X.iloc[0:2,[0,2]])

   id        name
0   1       Vitus
1   2  Maximilian

Remember the **half-open** intervals!

## 2.2. <a id='toc2_2_'></a>[Adding a variable](#toc0_)

Variables are added with `df['newvar'] = SOMETHING`. *The length must match or RHS is a scalar (broadcasting)*.

In [36]:
X['year'] = [2003, 2005, 2010]
X['zone'] = 7
X

   id   inc        name  year  zone
0   1  11.7       Vitus  2003     7
1   2  13.9  Maximilian  2005     7
2   3  14.6      Bo-Bob  2010     7

**Note:** You canNOT write `df.newvar = SOMETHING`. Some of you will forget. I promise.  
**Also:** note that you could add the year-variable even though it does not have an explicit row dimension.

The *something* can be an **expression based on other variables**.

In [37]:
X['inc_adj'] = X.inc - X.inc.mean() + 0.1
X

   id   inc        name  year  zone  inc_adj
0   1  11.7       Vitus  2003     7     -1.6
1   2  13.9  Maximilian  2005     7      0.6
2   3  14.6      Bo-Bob  2010     7      1.3

## 2.3. <a id='toc2_3_'></a>[Assignments to a subset of rows](#toc0_)

**LHS:** Selected using logical statement.<br>
**RHS:** Must either be:

1. a **single value** (all rows are set to this) 
2. a **list of values** with same length as the number of selected rows

**Multiple rows, one value:**

In [38]:
# Create copy of X to avoid overwriting it.
Y = X.iloc[:,0:4].copy()
Y.loc[Y.id > 1, ['name']] = 'no name'
print('Y After change in names:')
Y

Y After change in names:

   id   inc     name  year
0   1  11.7    Vitus  2003
1   2  13.9  no name  2005
2   3  14.6  no name  2010

**Multiple rows, multiple values:**

In [39]:
print('Original df:')
Y = X.iloc[:,0:4].copy()
display(Y)

# Subset the rows, where name is Vitus or year is 2005. LHS is incidentally only 2 rows, which match the RHS!
I = (Y.name == 'Vitus') | (Y.year == 2010)

# Print LHS
print('Subset of Y, LHS in assignment:')
display(Y.loc[I,:])

# Assignment
Y.loc[I, ['name']] = ['Bib', 'Peter']

print('Final Y:')
Y

Original df:

   id   inc        name  year
0   1  11.7       Vitus  2003
1   2  13.9  Maximilian  2005
2   3  14.6      Bo-Bob  2010

Subset of Y, LHS in assignment:

   id   inc    name  year
0   1  11.7   Vitus  2003
2   3  14.6  Bo-Bob  2010

Final Y:

   id   inc        name  year
0   1  11.7         Bib  2003
1   2  13.9  Maximilian  2005
2   3  14.6       Peter  2010

## 2.4. <a id='toc2_4_'></a>[Copies vs. views](#toc0_)

We have talked about references to objects before and how making changes in a reference also causes changes in the "original" object? When working with pandas you should also be wary of this. <br>
Whether some operation returns a copy or a view of the original object is slightly unstable and you can read more about this [here](https://pandas.pydata.org/docs/user_guide/indexing.html#returning-a-view-versus-a-copy). <br>
Interestingly, I was unable to recreate an error from last years lecture on my machine.

When **looking** at the data it is natural to just avoid the `.loc`:

In [40]:
# Here I'm NOT using the .loc function
Z = Y[['id','name']]
Z

   id        name
0   1         Bib
1   2  Maximilian
2   3       Peter

You can even make subsets without it:

In [41]:
I = Y['id'] > 1
Z[I]

   id        name
1   2  Maximilian
2   3       Peter

Importantly, this **does not work with assignment**.

**Case 1:** It does not work with views, as they are references.

In [42]:
display(X)

   id   inc        name  year  zone  inc_adj
0   1  11.7       Vitus  2003     7     -1.6
1   2  13.9  Maximilian  2005     7      0.6
2   3  14.6      Bo-Bob  2010     7      1.3

In [43]:
Y = X.copy()          # Create Y as a new instance by copying
I = Y['id'] > 2       # Boolean index
Z1 = Y[['id','name']] # Returns a copy (on my computer)

Z1[['name']] = 'test' # This creates a warning message

C:\Users\hms467\AppData\Local\Temp\ipykernel_7912\1410456911.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Z1[['name']] = 'test' # This creates a warning message

No changes are made to Y

In [44]:
display(Y)
display(Z1)

   id   inc        name  year  zone  inc_adj
0   1  11.7       Vitus  2003     7     -1.6
1   2  13.9  Maximilian  2005     7      0.6
2   3  14.6      Bo-Bob  2010     7      1.3

   id  name
0   1  test
1   2  test
2   3  test

You also should not chain assignments in one line (although it sometimes does work)

In [45]:
Y[['name']][I]='test' # This makes no change
display(Y)

C:\Users\hms467\AppData\Local\Temp\ipykernel_7912\4001473275.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Y[['name']][I]='test' # This makes no change
C:\Users\hms467\AppData\Local\Temp\ipykernel_7912\4001473275.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Y[['name']][I]='test' # This makes no change

   id   inc        name  year  zone  inc_adj
0   1  11.7       Vitus  2003     7     -1.6
1   2  13.9  Maximilian  2005     7      0.6
2   3  14.6      Bo-Bob  2010     7      1.3

In [46]:
Y['name'][I]='test' # While this does create a change
display(Y)

C:\Users\hms467\AppData\Local\Temp\ipykernel_7912\634630231.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Y['name'][I]='test' # While this does create a change

   id   inc        name  year  zone  inc_adj
0   1  11.7       Vitus  2003     7     -1.6
1   2  13.9  Maximilian  2005     7      0.6
2   3  14.6        test  2010     7      1.3

In [47]:
Y = X.copy() 
# But it works with Z2 
Z2 = Y.loc[:, ['id','name']] # Returns a copy
Z2.loc[I, ['name']] = 'test'
display(Z2)

# Importantly, we did not change names in Y
display(Y)

   id        name
0   1       Vitus
1   2  Maximilian
2   3        test

   id   inc        name  year  zone  inc_adj
0   1  11.7       Vitus  2003     7     -1.6
1   2  13.9  Maximilian  2005     7      0.6
2   3  14.6      Bo-Bob  2010     7      1.3

**Case 2:** Sometimes it works, but not how you want it to..

In [48]:
#display(X)
Y = X.copy()

I = Y['id'] > 1
Z = Y['name'] # returns a view of the column (same with Y.name)
Z[I] = 'test' # Reassigning values to the view of name in Y

## WOOPS:
display(Y)
display(Z)

C:\Users\hms467\AppData\Local\Temp\ipykernel_7912\3551774844.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Z[I] = 'test' # Reassigning values to the view of name in Y

   id   inc   name  year  zone  inc_adj
0   1  11.7  Vitus  2003     7     -1.6
1   2  13.9   test  2005     7      0.6
2   3  14.6   test  2010     7      1.3

0    Vitus
1     test
2     test
Name: name, dtype: object

**Solution:** Do the assignment in one step.

In [49]:
I = Y['id'] > 1
Y.loc[I, ['name']] = 'test'
Y

   id   inc   name  year  zone  inc_adj
0   1  11.7  Vitus  2003     7     -1.6
1   2  13.9   test  2005     7      0.6
2   3  14.6   test  2010     7      1.3

## 2.5. <a id='toc2_5_'></a>[The index](#toc0_)

The **first column** in the dataset is referred to as the `index` of the dataframe.<br>
**Baseline:** If you haven't done anything, it is just `[0, 1, 2, ....]`.

In [50]:
X = pd.DataFrame({'id': [1, 2, 3], 
                  'inc': [11.7, 13.9, 14.6], 
                  'name': ['Vitus', 'Maximilian', 'Bo-bob'],
                  'year': [2010, 2010, 2019]}) 

# See the indices of X
print(X.index.values)

[0 1 2]

**Custom:** You can actually use any **unique** identifier. It does not have to be numbers. For example, you can assign the name column to be the index instead.

In [51]:
Y = X.set_index('name') # returns a copy
Y # notice name is now below the other variables

            id   inc  year
name
Vitus        1  11.7  2010
Maximilian   2  13.9  2010
Bo-bob       3  14.6  2019

We could also have specified an index at creation of X

In [52]:
X = pd.DataFrame({'id': [1, 2, 3], 
                  'inc': [11.7, 13.9, 14.6],
                  'year': [2010, 2010, 2019]}, 
                  index= ['Vitus', 'Maximilian', 'Bo-bob'])
X

            id   inc  year
Vitus        1  11.7  2010
Maximilian   2  13.9  2010
Bo-bob       3  14.6  2019

In [56]:
# Use index of rows:
Y.loc['Vitus',:]

id         1.0
inc       11.7
year    2010.0
Name: Vitus, dtype: float64

In [57]:
# See the indices of Y
print(Y.index.values)

['Vitus' 'Maximilian' 'Bo-bob']

## 2.6. <a id='toc2_6_'></a>[Series and numpy arrays](#toc0_)

When you select an individual variable, it has the data type `Series`. Some functions work on a pandas series (e.g. most numpy functions), but it is sometimes nice to extract the underlying numpy objects: 

* `df`: **pandas dataframe** 
* `df['variable']`: **pandas series**
* `df['variabe'].values` (or `.to_numpy()`): **numpy array**

In [61]:
# One way to do it
X.inc.to_numpy()

array([11.7, 13.9, 14.6])

In [62]:
# Another way
display(X.inc.values)
type(X.inc.values)

array([11.7, 13.9, 14.6])

numpy.ndarray

In [63]:
# Get a list instead
display([*X['id'].values]) 
display(type([*X['id'].values]))

[1, 2, 3]

list

## 2.7. <a id='toc2_7_'></a>[Calling functions on a DataFrame](#toc0_)

**Row-by-row**  
Create function that takes row as an argument, and then **apply** the action of the function along the row dimension (axis=1).

In [64]:
Y = pd.DataFrame({'id': [1, 2, 3], 
                  'inc': [11.7, 13.9, 14.6],
                  'year': [2010, 2010, 2019], 
                  'name': ['Vitus', 'Maximilian', 'Bo-bob']})

# Notice that row is an input argument here
def conc_row_wise(row):
    return str(row['year']) + ' - ' + row['name'] 

# The fact that row is an input argument in the conc_row_wise function is implicitly understood by .apply()
Y['year_name'] = Y.apply(conc_row_wise, axis=1)  # Notice that axis = 1 is going down rows. Kind of confusing. 
Y

   id   inc  year        name          year_name
0   1  11.7  2010       Vitus       2010 - Vitus
1   2  13.9  2010  Maximilian  2010 - Maximilian
2   3  14.6  2019      Bo-bob      2019 - Bo-bob

**Function for numpy arrays:**  
Use the fact that a Pandas df is based on Numpy arrays to create a function that operate on the rows.   
This may involve broadcasting.

In [71]:
def all_at_once(inc, year):
    return inc * year.max() # Notice that the values of a pd DataFrame column is Numpy, so it has a .max() method. 

Y['inc_adj_year'] = all_at_once(Y.inc.values, Y.year.values)
Y

   id   inc  year        name          year_name  inc_adj_year
0   1  11.7  2010       Vitus       2010 - Vitus       23622.3
1   2  13.9  2010  Maximilian  2010 - Maximilian       28064.1
2   3  14.6  2019      Bo-bob      2019 - Bo-bob       29477.4

**Using the assign method of DataFrames**  
Apply the assign method coupled with a lambda function using the functionality of numpy arrays to get inplace changes:

In [72]:
Y2 = Y.assign(inc_adj_inplace = lambda x: x.inc * x.year.max() )
Y2

,id,inc,year,name,year_name,inc_adj_year,inc_adj_inplace
0,1,11.7,2010,Vitus,2010 - Vitus,23622.3,23622.3
1,2,13.9,2010,Maximilian,2010 - Maximilian,28064.1,28064.1
2,3,14.6,2019,Bo-bob,2019 - Bo-bob,29477.4,29477.4

There is an important distinction between creating a new column as `Y['newcolumn']` and using `Y.assign()`. 

In the latter you are adding a new column to an existing dataframe while `.assign()` creates an entirely new dataframe which is generally more memory intensive, so should generally only be used when you want to create a new dataframe.